[
  {
    "recipeId": "rcp37154",
    "recipeName": "A Checkerboard Of Roses ( Flower Arrangements)",
    "recipeCategory": "NA",
    "ingredients": [
      "green asparagus",
      "lemongrass",
      "roses",
      "asparagus"
    ],
    "prepTime": "30 mins",
    "cookTime": "0 mins",
    "tag": [
      "No Cooking Veg Indian",
      "Valentines Day Indian recipes"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "While at a party where the game of chess was the theme, our flower expert sonal panchmatia was inspired to create this checkerboard of roses. The arrangement is particularly aimed at embellishing a low dining0table sit-down. Complementing the roses in the arrangement is fresh, green asparagus and fragrant lemongrass.",
    "recipeUrl": "a-checkerboard-of-roses--flower-arrangements-37154r"
  },
  {
    "recipeId": "rcp37261",
    "recipeName": "A Truly Delectable Bunch ( Flower Arrangements)",
    "recipeCategory": "NA",
    "foodCategory": "NA",
    "ingredients": [],
    "prepTime": "30 mins",
    "cookTime": "0 mins",
    "tag": [
      "High Tea Party",
      "Western Party"
    ],
    "cuisineCategory": "NA",
    "recipeDescription": "This festive season make an irresistible bouquet that’s good enough to eat!",
    "recipeUrl": "a-truly-delectable-bunch--flower-arrangements-37261r"
  },
  {
    "recipeId": "rcp37167",
    "recipeName": "A-bun-dantly Creative ( Flower Arrangements)",
    "recipeCategory": "NA",
    "foodCategory": "NA",
    "ingredients": [
      "asparagus",
      "lavash"
    ],
    "prepTime": "30 mins",
    "cookTime": "0 mins",
    "tag": [
      "Western Party",
      "Cocktail Party"
    ],
    "cuisineCategory": "NA",
    "recipeDescription": "A floral centerpiece always adds a touch of class to a formal sit-down dinner. If you\u0027re planning a party and are too busy cooking and cleaning, rope your children into making an unusual arrangement that combines the elegance of flowers with the versatility of bread. Sonal panchmatia shows how!",
    "recipeUrl": "a-bun-dantly-creative--flower-arrangements-37167r"
  },
  {
    "recipeId": "rcp3904",
    "recipeName": "Aam Chana Achar, Rajasthani Pickle",
    "recipeCategory": "NA",
    "ingredients": [
      "grated raw mango",
      "kabuli chana (white chick peas)",
      "turmeric powder (haldi)",
      "salt",
      "fenugreek (methi) seeds",
      "fenugreek seeds (methi) powder",
      "fennel seeds (saunf)",
      "asafoetida (hing)",
      "nigella seeds (kalonji)",
      "whole dry kashmiri red chillies",
      "chilli powder",
      "mustard (rai / sarson) oil"
    ],
    "prepTime": "10 mins",
    "cookTime": "4 mins",
    "tag": [
      "Rajasthani Achaar Launji",
      "Pickles / Achar",
      "Indian Party",
      "Non-stick Pan"
    ],
    "cuisineCategory": "Rajasthani",
    "recipeDescription": "aam chana achar recipe | Rajasthani aam chana ka achar | Indian mango pickle with chana | kabuli chana achar | with 35 amazing images. aam chana achar recipe | Rajasthani aam chana ka achar | Indian mango pickle with chana | kabuli chana achar is perfect to try in the summer season when raw mangoes are at a peak. Learn how to make kabuli chana achar. To make aam chana achar, combine the raw mango, turmeric powder and salt in a deep bowl, mix well and keep aside for 30 minutes. Squeeze out all the water from the raw mango in a bowl and keep aside. Keep the raw mango water and grated raw mango separately. Refrigerate the grated raw mango overnight. Combine the fenugreek seeds, kabuli chana and raw mango water into a deep bowl, mix well and cover and keep aside overnight. Combine the fenugreek seed powder, fennel seeds, asafoetida, nigella seeds, kashmiri red chillies, chilli powder along the grated raw mango and kabuli chana-fenugreek seeds mixture into a deep bowl, mix well and keep aside. Heat the mustard oil in a deep non-stick kadhai on a medium flame for 3 to 4 minutes or till red hot. Remove from the flame and allow it to cool. Once cooled, add the oil to the prepared mixture and mix well. Bottle the pickle in a sterilized glass jar and keep aside for 6 to 7 days. After 7 days, it is ready to eat. Quick-fixes are there for every dish, from soups to pickles. However, the slow and steady method, although laborious, is often the tastiest. You will realise this truth when, after waiting for seven days, you first relish a spoonful of this delicious Indian mango pickle with chana. A typical Rajasthani pickle of raw mangoes and white chick peas perked up with a large assortment of spices and preserved with mustard oil, this Rajasthani aam chana ka achar has a wonderful mix of flavours ranging from sour to spicy. Tips for aam chana achar. 1. Mustard oil can be replaced with sesame oil or groundnut oil. 2. Remember to heat the oil very well. This helps to increase the shelf life of the pickle. 3. But you need to cool the oil before adding. 4. Remember to sterilize the jars before storing the pickle, so it will keep well for much longer. Enjoy aam chana achar recipe | Rajasthani aam chana ka achar | Indian mango pickle with chana | kabuli chana achar | with step by step photos.",
    "recipeUrl": "aam-chana-achar-rajasthani-pickle-3904r"
  },
  {
    "recipeId": "rcp30931",
    "recipeName": "Aam ka Achaar, Mango Pickle, Punjabi Achar",
    "recipeCategory": "NA",
    "ingredients": [
      "raw mangoes",
      "turmeric powder (haldi)",
      "fennel seeds (saunf)",
      "split fenugreek seeds (methi na kuria)",
      "split mustard seeds (rai na kuria)",
      "nigella seeds (kalonji)",
      "asafoetida (hing)",
      "chilli powder",
      "mustard (rai / sarson) oil",
      "salt"
    ],
    "prepTime": "15 mins",
    "cookTime": "10 mins",
    "tag": [
      "Punjabi Raita | Punjabi Chutney | Achar",
      "Pickles / Achar",
      "Spicy Achar",
      "Indian Party"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "aam ka achar recipe | Punjabi aam ka achar | mango pickle | with 27 amazing images. aam ka achar recipe | Punjabi aam ka achar | mango pickle is one of the favourites of all pickle lovers! Learn how to make Punjabi aam ka achar. To make aam ka achar, combine the mangoes, turmeric powder and 2 tbsp of salt and toss well. Place the mangoes on a sieve, cover with a muslin cloth and place under the sun for 4 to 6 hours. Combine the rest of the ingredients in a bowl and mix well. Add the mangoes and toss well. Bottle the pickle in a sterilized glass jar. Place the pickle under the sun for 4 to 5 days. This aam ka achaar can be stored for upto 1 year. During the mango season in the summer in Punjab, one can see at least two or three earthenware jars full of pickled raw mangoes maturing in the sun outside homes. This typical Punjabi aam ka achar recipe for making mango pickle is most popular in the region. This is a very simple recipe to follow. The combination of fennel seeds, nigella seeds with mustard and other pickling spices is what distinguishes this mango pickle from its equally famous Gujarati counter part. Sun-dried mangoes used in this pickle impart a salty chewy character and also improve the shelf life of the pickle. We recommend the use of mustard oil to make this aam ka achar as it is best suited for making achar. However, you can use any other oil if you wish to. Tips for aam ka achar. 1. Just keep in mind the basics of pickle making a clean sterilized jar and see that there is no moisture in the jar before adding the pickle. 2. Ensure that mustard oil forms a covering layer over the ingredients in the jar. This acts as a preservative and prevents spoilage. 3. We recommend you use a measured quantity of salt for this recipe to get the perfect taste. Also salt acts as a preservative too. 4. During storage, once in a while, take a spoon and mix the pickle in the jar. This is to ensure that the entire pickle is well soaked in oil. 5. Remember never to touch the pickle with your hand. The warmth of your hand may be a reason for spoilage. So use a spoon for serving. Enjoy aam ka achar recipe | Punjabi aam ka achar | mango pickle | with step by step photos.",
    "recipeUrl": "aam-ka-achaar-mango-pickle-punjabi-achar-30931r"
  },
  {
    "recipeId": "rcp36291",
    "recipeName": "Aam Ke Pakode, Mango Bhajiya",
    "recipeCategory": "NA",
    "ingredients": [
      "mango cubes",
      "oil",
      "besan (bengal gram flour)",
      "rice flour (chawal ka atta)",
      "carom seeds (ajwain)",
      "chilli powder",
      "turmeric powder (haldi)",
      "asafoetida (hing)",
      "salt"
    ],
    "prepTime": "15 mins",
    "cookTime": "20 mins",
    "tag": [
      "Course",
      "Indian Snacks using Fruits",
      "Indian Snacks for Entertaining",
      "Deep-fried Indian Starters",
      "Jain Snacks",
      "Evening Tea Snacks",
      "Pakora Pakoda"
    ],
    "cuisineCategory": "Jain",
    "recipeDescription": "You would have tried bhajiyas with all kinds of veggies ranging from onions to raw bananas, and you might even have tried making it with ripe yellow bananas. But, have you ever had a taste of Aam ke Pakode or Mango Bhajiyas? Well, this delightful seasonal treat is a must-try. Choose ripe and sweet Alphonso mangoes, cube them, dip them in a spicy batter and deep-fry till crisp, and voila, you have an absolutely awesome tea-time snack ready.",
    "recipeUrl": "aam-ke-pakode-mango-bhajiya-36291r"
  },
  {
    "recipeId": "rcp3427",
    "recipeName": "Aam ki Katki ka Muraba",
    "recipeCategory": "NA",
    "foodCategory": "NA",
    "ingredients": [
      "chopped raw mango",
      "grated raw mango",
      "sugar",
      "Sambhaar",
      "peeled and sliced almonds",
      "poppy seeds (khus-khus)",
      "salt"
    ],
    "prepTime": "15 mins.",
    "cookTime": "45 mins.",
    "tag": [
      "Pickles / Achar",
      "Sugar Based Pickles"
    ],
    "cuisineCategory": "NA",
    "recipeDescription": "Murabba or \"morabba\" is an Arabic word meaning to preserve. This versatile murabba is made of finely chopped raw mangoes cooked in thick sugar syrup and spiced with sambhaar. Chop the mango pieces evenly so that they cook well in the sugar syrup and also look attractive. Enjoy this pickle with hot rotis or a spicy vegetable.",
    "recipeUrl": "aam-ki-katki-ka-muraba-3427r"
  },
  {
    "recipeId": "rcp3901",
    "recipeName": "Aam ki Launji",
    "recipeCategory": "NA",
    "ingredients": [
      "raw mango cubes",
      "oil",
      "fennel seeds (saunf)",
      "nigella seeds (kalonji)",
      "coriander (dhania) powder",
      "chilli powder",
      "turmeric powder (haldi)",
      "sugar",
      "salt"
    ],
    "prepTime": "5 mins",
    "cookTime": "6 mins",
    "tag": [
      "Rajasthani Achaar Launji",
      "Pickles / Achar",
      "Indian Party",
      "Non-stick Pan"
    ],
    "cuisineCategory": "Rajasthani",
    "recipeDescription": "Quick and easy pickle that tickles your palate! Aam ki Launji is made by cooking mangoes with a readily available selection of spices and powders. No complex methods, tricky proportions or pickling time involved in making this, yet it stays fresh for almost four days in the refrigerator. This sweet and spicy Aam ki Launji can be served with parathas or rotis of your choice.",
    "recipeUrl": "aam-ki-launji-3901r"
  },
  {
    "recipeId": "rcp2848",
    "recipeName": "Aam Lassi Slush",
    "recipeCategory": "NA",
    "ingredients": [
      "mango cubes",
      "curds (dahi)",
      "chopped mint leaves (phudina)",
      "sugar",
      "ice-cubes",
      "mint leaves (phudina)"
    ],
    "prepTime": "10 mins",
    "cookTime": "0 mins",
    "tag": [
      "Punjabi Drinks",
      "Indian Drinks / Sharbats",
      "Indian Birthday Party",
      "Refrigerator",
      "Sweet Recipes for Kids",
      "Kids After School",
      "Calcium Rich Indian Drinks Smoothies Juices"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "Here, we bring together two favourite beverage formats – slush and lassi! Rich and luscious mango lassi is blended with mint leaves and ice cubes to get a slushy, peppy drink, which is sure to be enjoyed by everybody. Remember to let the Aam Lassi Slush rest a while out of the freezer so you can mix it up with a fork before serving, with an appetizing garnish of mint leaves.",
    "recipeUrl": "aam-lassi-slush-2848r"
  },
  {
    "recipeId": "rcp6201",
    "recipeName": "Abc Juice, Apple Beet Carrot Juice",
    "recipeCategory": "NA",
    "ingredients": [
      "carrot cubes",
      "beetroot cubes",
      "apple cubes",
      "chopped ginger (adrak)",
      "lemon juice",
      "water",
      "ice cubes"
    ],
    "prepTime": "10 mins",
    "cookTime": "0 mins",
    "tag": [
      "Low Cal Beverages",
      "No Cooking Veg Indian",
      "Mixer",
      "Juicer and Hopper",
      "Pregnancy",
      "Indian Healthy Veg Snack",
      "Indian Cancer Patients"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "apple beet carrot juice recipe | abc Indian juice | healthy carrot, beet, ginger, apple drink | with 14 amazing images. apple beet carrot juice is a Phosphorus and fibre rich drink. Learn to make healthy carrot, beet, ginger and apple drink. Kick start your day with this energy boosting apple beet carrot juice. Rich in flavour and nutrients, it satisfies aesthetic as well as nutritional demands. The abc Indian juice contains beetroot, which is the richest source of natural sugars. The Nitrates present in beet aid in detoxification and help lower bad cholesterol (LDL) levels. Carrots in apple beet carrot juice relieve constipation, lower blood pressure, have fibre and lower cholesterol. Tips for apple beet carrot juice. 1. Add chopped ginger (adrak). Adding ginger gives a super flavour to abc juice. 2. Only a high quality mixer will blend carrots. 3. Add 1 cup water. This makes it easier to blend the hard carrots. Enjoy apple beet carrot juice recipe | abc Indian juice | healthy carrot, beet, ginger, apple drink | with step by step photos.",
    "recipeUrl": "abc-juice-apple-beet-carrot-juice-6201r"
  },
  {
    "recipeId": "rcp32665",
    "recipeName": "Achaari Aloo Roll ( Wraps and Rolls)",
    "recipeCategory": "NA",
    "ingredients": [
      "grated raw mangoes",
      "turmeric powder (haldi)",
      "salt",
      "fenugreek (methi) seeds",
      "kabuli chana (white chick peas)",
      "fenugreek seeds (methi) powder",
      "fennel seeds (saunf)",
      "asafoetida (hing)",
      "nigella seeds (kalonji)",
      "whole dry kashmiri red chillies",
      "chilli powder",
      "mustard (rai / sarson) oil",
      "oil",
      "cumin seeds (jeera)",
      "chopped onions",
      "chopped green chillies",
      "grated ginger (adrak)",
      "mashed potatoes",
      "boiled green peas",
      "chaat masala",
      "garam masala",
      "chopped coriander (dhania)",
      "salt",
      "onion rings",
      "chaat masala",
      "rotis"
    ],
    "prepTime": "20 mins",
    "cookTime": "20 mins",
    "tag": [
      "Indian Rolls, Veg Roll",
      "Saute",
      "Refrigerator",
      "Non Stick Kadai Veg"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "Achaar is synonymous with indian cuisine. Undoubtedly, it adds a brilliant touch to wraps too! lacing the spicy potato filling with aam aur chane ka achaar makes your tongue tingle with joy. I’m sure you’ll love it purely because of its simplicity. This recipe has to be planned in advance as the achaar has to be marinated for 3 to 4 days. Else, you can buy readymade aam ka achaar.",
    "recipeUrl": "achaari-aloo-roll--wraps-and-rolls-32665r"
  },
  {
    "recipeId": "rcp32939",
    "recipeName": "Achaari Paneer Tikka",
    "recipeCategory": "NA",
    "ingredients": [
      "green chilli pickle",
      "hung curds (chakka dahi)",
      "chopped garlic (lehsun)",
      "fennel seeds (saunf)",
      "mustard seeds ( rai / sarson)",
      "fenugreek (methi) seeds",
      "nigella seeds (kalonji)",
      "cumin seeds (jeera)",
      "turmeric powder (haldi)",
      "mustard (rai / sarson) oil",
      "salt",
      "paneer (cottage cheese) cubes",
      "oil",
      "dahiwali pudina chutney"
    ],
    "prepTime": "10 mins",
    "cookTime": "10 mins",
    "tag": [
      "Punjabi",
      "Punjabi Swadisht Nashta",
      "Punjabi Paneer Recipes",
      "Indian Snacks for Entertaining",
      "Paneer Based Snacks",
      "Kitty Party",
      "Mother\u0027s Day"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "Indian achari paneer tikka recipe | Punjabi style achari paneer tikka | paneer tikka snack | healthy achari tikka | with 23 amazing images. Indian achari paneer tikka is a quick starter for a daily fare and remarkable as a party treat too! Learn how to make easy Punjabi achari paneer tikka. Succulent cottage cheese in a pure desi avatar in paneer tikka snack! Marinated in an intensely spicy achari marinade, which reflects the flavour of green chilli pickle, the paneer cubes are arranged into a satay and cooked till perfectly crisp outside, soft inside, and flavourful through and through. The best part is that this Punjabi style achari paneer tikka is not senselessly spicy – it has an exciting blend of flavours ranging from green chilli pickle to magical spices like fennel and nigella seeds, which are sure to fascinate your taste buds. To make Indian achari paneer tikka, make the achari marinade by combining green achar, hung curd and a host of spices. Add the paneer to the prepared achaari marinade, mix gently and keep aside to marinate for 20 minutes. Arrange the marinated paneer cubes equally on satay sticks and keep aside. Heat a non-stick tava (griddle), grease it with little oil, place a few satays on it and cook on a medium flame, using a little oil, till they turn golden brown in colour from all the sides. Repeat step 3 to cook more satays. Serve immediately with dahiwali phudina chutney. This healthy achari tikka abounds in protein because of its 2 main ingredients – paneer and curd. One serving of this tikka lends 9.5 g of protein along with 364.7 mg of calcium for bone strengthening. However, do not forget the calories it lends. You can reduce the calorie count by making use of its low fat counterparts – low fat paneer and low fat curd. Also remember to cook it on a non-stick tava with minimum use of oil. Tips for Indian achari paneer tikka. 1. 18. If you are making hung curd at home, ensure that you tie and hang the curd for at least an hour to get a perfect thick curd. Watery curd might render the marinade to be thin and difficult to coat the tikkas. 2. Use only fresh paneer, for best results and perfect smooth texture. 3. Do not overcook the tikkas, else the paneer might become chewy. Enjoy Indian achari paneer tikka recipe | Punjabi style achari paneer tikka | paneer tikka snack | healthy achari tikka | with step by step photos below.",
    "recipeUrl": "achaari-paneer-tikka-32939r"
  },
  {
    "recipeId": "rcp36293",
    "recipeName": "Achaari Paneer Warqi",
    "recipeCategory": "NA",
    "ingredients": [
      "crumbled paneer (cottage cheese)",
      "mustard (rai / sarson) oil",
      "cumin seeds (jeera)",
      "fennel seeds (saunf)",
      "fenugreek (methi) seeds",
      "nigella seeds (kalonji)",
      "mustard seeds ( rai / sarson)",
      "chopped onions",
      "grated ginger (adrak)",
      "chopped green chillies",
      "turmeric powder (haldi)",
      "chopped coriander (dhania)",
      "salt",
      "samosa pattis",
      "nigella seeds (kalonji)",
      "turmeric powder (haldi)",
      "chilli powder",
      "oil"
    ],
    "prepTime": "20 mins",
    "cookTime": "20 mins",
    "tag": [
      "Indian Snacks for Entertaining",
      "Paneer Based Snacks",
      "High Tea Party",
      "Oven",
      "Pan"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "Achaari paneer warqi, paneer cooked in indian spices and seasonings and served on top of the baked warqi samosa pattis.",
    "recipeUrl": "achaari-paneer-warqi-36293r"
  },
  {
    "recipeId": "rcp22718",
    "recipeName": "Achar Dip, Achari Dip",
    "recipeCategory": "NA",
    "ingredients": [
      "hung curds (chakka dahi)",
      "salt",
      "fenugreek (methi) seeds",
      "mustard seeds ( rai / sarson)",
      "cumin seeds (jeera)",
      "fennel seeds (saunf)",
      "nigella seeds (kalonji)",
      "oil",
      "asafoetida (hing)",
      "chopped coriander (dhania)",
      "chopped green chillies",
      "powdered sugar",
      "khakhras"
    ],
    "prepTime": "2 mins",
    "cookTime": "1 mins",
    "tag": [
      "Jain International",
      "Indian Dips / Sauces",
      "Cocktail Party",
      "Fondue Party",
      "Quick Indian Dips, Gravies \u0026 Sauces"
    ],
    "cuisineCategory": "Jain",
    "recipeDescription": "achari dip recipe | healthy achar dip | Indian achari dip | with amazing 15 images. achari dip recipe is an Indian dip made with a base of curds, tempered with five aromatic spices, perked up with coriander and green chillies, and chilled to a pleasant temperature. This lip-smacking achari dip will make your taste buds tingle with joy. The achari dip is really quick and easy to make. All you need to do is hang the curd well in advance and keep aside. Further, take oil in a small pan, add fennel seeds, mustard seeds, cumin seeds, methi seeds, kalonji, asafoetida and cook them for a while. Once cooked, let them cool. Transfer to a mixing jar along with coriander leaves, green chillies, powdered sugar and little water and blend everything well. Next, combine hung curd with the prepared achari mixture, whisk well. Make sure it has no lumps. Your achari dip is ready. Refrigerate achari dip for one hour and serve chilled with whole wheat methi khakhras, cucumber sticks and carrot sticks. See why we think this is a healthy achar dip? Made from curds, coriander and Indian spices, this is a perfect accompaniment. Curds help in digestion as it has very good bacteria. They help in weight reduction, good for your heart and build immunity. If you are on a weight loss schedule, then use low fat curds. You can skip the sugar in the recipe as its there to offset the sourness of curd. This healthy achar dip is also nice to serve at parties to complement starters like Kebabs and Tikkis. Enjoy achari dip recipe | healthy achar dip | Indian achari dip | with detailed step by step photos and video below.",
    "recipeUrl": "achar-dip-achari-dip-22718r"
  },
  {
    "recipeId": "rcp30888",
    "recipeName": "Achari Baingan",
    "recipeCategory": "NA",
    "ingredients": [
      "ginger-garlic (adrak-lehsun) paste",
      "chilli powder",
      "turmeric powder (haldi)",
      "salt",
      "oil",
      "brinjals (baingan / eggplant) , cut into 1\" cubes",
      "oil",
      "fennel seeds (saunf)",
      "mustard seeds ( rai / sarson)",
      "fenugreek (methi) seeds",
      "nigella seeds (kalonji)",
      "cumin seeds (jeera)",
      "asafoetida (hing)",
      "oil",
      "sliced onions",
      "ginger-garlic (adrak-lehsun) paste",
      "chopped green chillies",
      "turmeric powder (haldi)",
      "chilli powder",
      "punjabi garam masala",
      "dried mango powder (amchur)",
      "salt",
      "whisked curds (dahi)",
      "cream",
      "chopped coriander (dhania)"
    ],
    "prepTime": "15 mins",
    "cookTime": "15 mins",
    "tag": [
      "Punjabi Sabzis",
      "Traditional Indian Sabzis",
      "Deep Fry",
      "Indian Party",
      "Pan"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "This is one of the most delicious methods of cooking brinjal or Baingan. The achaaris masala is very popular in Punjabi cooking and contrary to popular belief does not use any actual achaar or pickle. It is a flavourful blend of carefully chosen spices and curds. The achaaris masala is truly representative of the variety of spices used in Punjabi cooking such as onion seeds (kalonji), mustard seeds, garam masala and dry mango powder. Here I have added the very versatile brinjal to this tongue ticking masala. However feel free to add any vegetable of you choice or even paneer to the achaaris gravy.",
    "recipeUrl": "achari-baingan-30888r"
  },
  {
    "recipeId": "rcp30922",
    "recipeName": "Achari Chana Pulao, Pickled Kabuli Chana Pulao",
    "recipeCategory": "NA",
    "ingredients": [
      "aam ka achaar",
      "boiled kabuli chana (white chick peas)",
      "long grained rice (basmati)",
      "ghee",
      "fennel seeds (saunf)",
      "mustard seeds ( rai / sarson)",
      "fenugreek (methi) seeds",
      "nigella seeds (kalonji)",
      "black cardamom (badi elaichi)",
      "cumin seeds (jeera)",
      "asafoetida (hing)",
      "sliced onions",
      "ginger-garlic (adrak-lehsun) paste",
      "turmeric powder (haldi)",
      "chilli powder",
      "garam masala",
      "salt",
      "chopped coriander (dhania)"
    ],
    "prepTime": "15 mins",
    "cookTime": "15 mins",
    "tag": [
      "Course",
      "Punjabi Pulao | Punjabi Rice, Biryani",
      "Mother\u0027s Day",
      "Father\u0027s Day",
      "Pressure Cooker",
      "Lunch Pulao Rice"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "achari chana pulao | achari pulao | chickpea pulao | pickled kabuli chana pulao | with amazing 29 images achari chana pulao also known as pickled kabuli chana pulao is for those who love the complex interplay of spices in pickles, rice and kabuli chana. Learn how to make achari chana pulao easily. Achari in the name stands for pickle flavoured, this chickpea pulao is flavoured with pickle which makes the dish even interesting. To make achari chana pulao rice, fortified with kabuli chana, is perked up with an interesting assortment of spices ranging from nigella and fenugreek to fennel seeds and black cardamoms, along with some readymade spice powders too. But, the real twist in this pickled kabuli chana pulao recipe is the addition of a couple of spoons of aam ka achar, which gives a really sprightly flavour and aroma to the pulao. Ingredients used to make achari chana pulao are basic and I am sure can be found in every Indian household. I usually prepare this one-pot quick meal on tiring and long days along with any raita and papad. Each and every member in my family simply loves achari chana pulao, not even my kids create a fuss while eating it. It is also a great tiffin treat or lunch box option. achari chana pulao can be served simply with a cup of curd, or perhaps a bowl of dal like Dahiwali Toovar Dal , Dal Kadhi, Masoor Dal or Tamatar ki Kadhi. Learn to make achari chana pulao | achari pulao | chickpea pulao | pickled kabuli chana pulao | with detailed step by step photos.",
    "recipeUrl": "achari-chana-pulao-pickled-kabuli-chana-pulao-30922r"
  },
  {
    "recipeId": "rcp22779",
    "recipeName": "Achari Dahi Bhindi, Punjabi Sabji",
    "recipeCategory": "NA",
    "ingredients": [
      "sliced ladies finger (bhindi)",
      "oil",
      "fennel seeds (saunf)",
      "mustard seeds ( rai / sarson)",
      "nigella seeds (kalonji)",
      "fenugreek (methi) seeds",
      "asafoetida (hing)",
      "chopped ginger (adrak)",
      "chopped tomatoes",
      "salt",
      "whisked curds (dahi)",
      "chilli powder",
      "turmeric powder (haldi)",
      "coriander-cumin seeds (dhania-jeera) powder",
      "salt",
      "rotis parathas"
    ],
    "prepTime": "10 mins",
    "cookTime": "13 mins",
    "tag": [
      "Punjabi Sabzis",
      "Indian Tiffin Box, Lunch box, Dabba",
      "Indian Party",
      "Quick Sabzis",
      "Lunch Sabzi"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "achari dahi bhindi recipe | Punjabi dahi bhindi sabji | achari dahi wali bhindi | okra in achari curd gravy | with amazing 33 images. achari dahi bhindi recipe is a tangy Punjabi bhindi sabzi with the combined sourness of curds and tomatoes, perked up with a wide assortment of seeds and spice powders, which give it a super peppy flavour and aroma too. The name achari comes from the combination of spices used in achari dahi bhindi. The same spices used in achari dahi bhindi are also used to make pickles or achar in Northern India. Bored of having the usual subzi’s? We have got you a unique recipe which is super easy to make and will definitely give a roller coaster ride to your taste buds “achaari dahi bhindi” The ingredients used to make achari dahi bhindi are easily available in every well maintained Indian household pantry. We have made bhindi tastier by giving it a unique twist. We have divided the procedure of making “achari dahi bhindi”. The first step is to prepare the yogurt mixture which needs whisked curds, red chilli powder, turmeric powder, coriander-cumin seed powder to be mixed well. You can also add coriander to the curd mixure if you wish to. The second step is to cook bhindi in mustard oil until cooked and becomes non-sticky. You can deep fry your bhindi if you wish to, we have used sautéing as the cooking method. Lastly, remove bhindi in a plate and keep aside. Take the same pan and add mustard oil which gives the sabzi achari taste. Add fennel seeds, nigella seeds, mustard seeds, fenugreek seeds and asafetida cook. Add ginger, you can skip if you wish to. Add tomatoes and cook. Tomatoes also provide tanginess to the sabzi. Once the tomatoes are cooked, add the curd mixture. Make sure you have lowered the flame or your curd will tend to curdle. Lastly, add the cooked and shallow fried ladies finger and cook. The ladies finger is sliced and shallow-fried before preparing the gravy, so that it has a nice texture and does not end up gooey, which sometimes happens when you add bhindi to a dish without sautéing it properly. I usually use achari bhindi as tiffin treat as it is a dry sabzi and also easy to make. Punjabi dahi bhindi sabji is also now found on the menu of many Indian restaurants. Serve Punjabi achari dahi bhindi sabji hot with any roti or parathas of your choice. Enjoy achari dahi bhindi recipe | Punjabi dahi bhindi sabji | achari dahi wali bhindi | okra in achari curd gravy | with detailed step by step recipe photos and video below.",
    "recipeUrl": "achari-dahi-bhindi-punjabi--sabji-22779r"
  },
  {
    "recipeId": "rcp1736",
    "recipeName": "Achari Paneer",
    "recipeCategory": "Dinner",
    "ingredients": [
      "paneer (cottage cheese) cubes",
      "oil",
      "fennel seeds (saunf)",
      "mustard seeds ( rai / sarson)",
      "fenugreek (methi) seeds",
      "nigella seeds (kalonji)",
      "cumin seeds (jeera)",
      "asafoetida (hing)",
      "sliced onions",
      "turmeric powder (haldi)",
      "chilli powder",
      "black salt (sanchal)",
      "whisked curds (dahi)",
      "plain flour (maida)",
      "chopped coriander (dhania)",
      "salt"
    ],
    "prepTime": "10 mins",
    "cookTime": "6 mins",
    "tag": [
      "Punjabi Sabzis",
      "Punjabi Paneer Recipes",
      "Dinner",
      "Quick Sabzis",
      "Saute",
      "Indian Party",
      "Kadai Veg"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "achari paneer recipe | Punjabi achari paneer | restaurant style achari paneer | healthy achari paneer | with 19 amazing images. achari paneer recipe is also called Punjabi achari paneer and we made it restaurant style achari paneer. This is an Indian curry made of cottage cheese (paneer), onions, curds and lots of spices. Paneer is the most commonly consumed source of protein for vegetarians. Due to its bland flavour and ability to absorb any flavour as in this Punjabi achari paneer recipe. Achari paneer is an aromatic accompaniment, which imbibes its flavour from a mixture of seeds used in the seasoning. Preparation for achari paneer takes no time and can be prepared in a jiffy. The restaurant style achari paneer is so easy and quick to make that you can include it to your everyday meal list. Achari paneer is made with pickling spices and is best relished with any Indian bread. The taste of the dish is tangy and pickly yet the dish is named as achari paneer, achar are usually tangy, sour and slightly spicy. Make this super easy, quick and lip-smacking Punjabi sabzi for weekend lunch or dinner. Use mustard oil if available as it would enhance the taste of our restaurant style achari paneer and give it the perfect desired flavor. We have added plain flour which prevents the curd added in the gravy from curdling. You can also use besan. See why we think this is a healthy achari paneer? Made from paneer which contains high quality protein and calcium which aids in weight loss. Since paneer is low in carbs and high in protein it gets digested slowly and hence good for diabetes. For diabetics, use low fat paneer. Serve restaurant style achari paneer hot with rotis or butter naan. Try other recipes like Achari Baingan or Chatakedar Paneer. Enjoy achari paneer recipe | Punjabi achari paneer | restaurant style achari paneer | healthy achari paneer | with detailed step by step recipe photos and video below.",
    "recipeUrl": "achari-paneer-1736r"
  },
  {
    "recipeId": "rcp7555",
    "recipeName": "Achari Paneer Pulao, Paneer Tikka Rice",
    "recipeCategory": "NA",
    "ingredients": [
      "paneer (cottage cheese) cubes",
      "oil",
      "mustard seeds ( rai / sarson)",
      "fenugreek (methi) seeds",
      "cumin seeds (jeera)",
      "nigella seeds (kalonji)",
      "fennel seeds (saunf)",
      "turmeric powder (haldi)",
      "chilli powder",
      "whisked curds (dahi)",
      "green chilli pickle",
      "salt",
      "cooked rice (chawal)",
      "oil",
      "cinnamon (dalchini)",
      "cloves (laung / lavang)",
      "caraway seeds (shahjeera)",
      "cardamoms (elaichi)",
      "salt",
      "chopped coriander (dhania)"
    ],
    "prepTime": "15 mins",
    "cookTime": "5 mins",
    "tag": [
      "Jain Rice",
      "Mughlai Chawal, Mughlai Biryani",
      "Indian Tiffin Box, Lunch box, Dabba",
      "Traditional Indian Rice Recipes",
      "Pulaos",
      "biryani recipes across India",
      "Indian Party"
    ],
    "cuisineCategory": "Jain",
    "recipeDescription": "achari paneer pulao recipe | Indian paneer tikka pulao | paneer tikka rice | achari biryani | with 29 amazing images. achari paneer pulao recipe | Indian paneer tikka pulao | paneer tikka rice | achari biryani is a perfect party fare. Learn how to make Indian paneer tikka pulao. To make achari paneer pulao, heat the oil in a kadhai, add the mustard seeds, fenugreek seeds, cumin seeds, nigella seeds and fennel seeds. When the seeds crackle, add the turmeric powder, chilli powder and switch off the flame. Add the curds and mix well. Add the green chilli pickle and salt and mix well. Add the paneer cubes, mix gently and keep aside to marinate for 30 minutes. Heat the oil in a non-stick pan, add the cinnamon, cloves, caraway seeds and cardamom. When the caraway seeds crackle, add the rice and salt, mix well and cook on medium flame for 1 minute, while stirring continuously. Add the marinated paneer, mix well and cook on a medium flame for 1 to 2 minutes, while stirring occasionally. Serve hot garnished with coriander. Paneer, marinated with achari spices like fennel and nigella is tossed together with rice, which is cooked to perfection with typical spices like cinnamon, cloves, cardamom and caraway. This gives the feeling of having a nice paneer tikka rice with a mild pickle, but it comes in a single package, making it convenient to serve or pack. Cooked rice which has grains separate and making the perfect soft paneer is the essence of this achari biryani. While you can buy readymade paneer, when you have time on hand try making paneer at home. All you need is a bowl of raita and perhaps a papad to complete this flavourful meal of Indian paneer tikka pulao. Together they make a wholesome and satiating meal. Tips for achari paneer pulao. 1. Use fresh curd to make achari paneer. 2. Whisk the curd before making the marinade, so it mixes well with the spices. 3. Before adding the curd, remember to switch off the flame. This is to prevent the curd from splitting. 4. Mix the achari paneer pulao gently or else the paneer cubes will break. Enjoy achari paneer pulao recipe | Indian paneer tikka pulao | paneer tikka rice | achari biryani | with step by step photos.",
    "recipeUrl": "achari-paneer-pulao-paneer-tikka-rice-7555r"
  },
  {
    "recipeId": "rcp4772",
    "recipeName": "Achari Paneer Tikka",
    "recipeCategory": "NA",
    "ingredients": [
      "green chilli pickle",
      "hung curds (chakka dahi)",
      "chopped garlic (lehsun)",
      "fennel seeds (saunf)",
      "mustard seeds ( rai / sarson)",
      "fenugreek (methi) seeds",
      "nigella seeds (kalonji)",
      "cumin seeds (jeera)",
      "turmeric powder (haldi)",
      "mustard (rai / sarson) oil",
      "salt",
      "paneer (cottage cheese) cubes",
      "oil"
    ],
    "prepTime": "10 mins",
    "cookTime": "10 mins",
    "tag": [
      "Course",
      "Punjabi Paneer Recipes",
      "Starters / Snacks",
      "Indian Snacks for Entertaining",
      "Tikki Recipes, Collection of Tikki",
      "Barbeque",
      "Raksha - Bandhan"
    ],
    "cuisineCategory": "Punjabi",
    "recipeDescription": "achari paneer tikka recipe | Punjabi achari paneer tikka | achari paneer tikka on tawa | healthy achari paneer tikka | with 23 amazing images. achari paneer tikka recipe is a Punjabi achari paneer tikka. Every Indian has a tawa at home and we show you how to make achari paneer tikka on a tawa. Punjabi achari paneer tikka has now become one of the most popular starters in Indian restaurants. Cottage cheese marinated in a mix of classic pickle Indian spices, strung into skewer sticks, and cooked in a tawa is achari paneer tikka on tawa. The ingredients used for making achari paneer tikka are easily available and if your pantry is well maintained. Making achari paneer tikka on tawa is very easy and can be quickly made. To make achari paneer tikka in oven, first we have marinated the paneer in a pickle marinade. To make the marinade, we have combined green chili pickle, garlic, fennel seeds, mustard seeds, fenugreek seeds, nigella seeds, cumin seeds, turmeric and mustard oil I a blender and blend it. Once the mixture is blend, we have mixed it with hung curd and our achari marinade is ready. Once our marinade is ready, add the paneer to the marinade. Gently mix and coat paneer well and leave it for 20 mins, you can also marinate for long time if you wish to. Further, once the paneer has been marinated, arrange the marinated paneer cubes equally on satay sticks and keep aside. In case you are using bamboo skewers, soak them in water for at least an hour before grilling or else the skewers might get burnt. Cook them on a greased tava by drizzling little oil over it, until it is golden brown and cooked. Remove Punjabi achari paneer tikka in a plate and you can sprinkle some chaat masala and lemon juice if you wish to. Make sure the paneer you are using in Punjabi achari paneer tikka is firm and not crumbly. If the weather outside is too hot and you want to marinate the paneer for a longer time ensure to put it in the refrigerator. You can even make use of veggies like onions, tomatoes, capsicum and bell peppers while preparing achari paneer tikka. Do not overcook the paneer as it may turn chewy and tough. You can serve achari paneer tikka alone or with a platter of tandoori starters along with laccha onions, green chutney and lemon wedges. You can also use it to make delectable snacks like the Paneer Tikka Sub Sandwich or Paneer Tikka Wrap. See why this is a healthy achari paneer tikka. The recipe is made mainly from paneer and spices. Paneer contains high quality protein and calcium which aids in weight loss. Since paneer is low in carbs and high in protein it gets digested slowly and hence good for diabetes the achari paneer tikka tastes awesome with pudina chutney. Make a main course out of achari paneer tikka, such as the achari paneer pulao, which can be enjoyed with raita and roti. Use it innovatively to make more dishes like paratha, sizzlers and kathi rolls. Enjoy achari paneer tikka recipe | Punjabi achari paneer tikka | achari paneer tikka on tawa | healthy achari paneer tikka | with detailed step by step photos and video below.",
    "recipeUrl": "achari-paneer-tikka-4772r"
  },
  {
    "recipeId": "rcp22270",
    "recipeName": "Adai , Diabetic Adai Recipe",
    "recipeCategory": "NA",
    "ingredients": [
      "broken wheat (dalia)",
      "green moong dal (split green gram)",
      "masoor (split red lentil) dal",
      "urad dal (split black lentils)",
      "fenugreek (methi) seeds",
      "chopped onions",
      "asafoetida (hing)",
      "ginger-green chilli paste",
      "chopped coriander (dhania)",
      "turmeric powder (haldi)",
      "chopped curry leaves (kadi patta)",
      "salt",
      "oil"
    ],
    "prepTime": "10 mins",
    "cookTime": "40 mins",
    "tag": [
      "South Indian Evening Snacks",
      "Different Types of Dosa",
      "South Indian Breakfast",
      "Breakfast Idlis / Dosas / Uttapam",
      "Breakfast Chillas, Indian Pancakes",
      "Indian Pancakes",
      "Evening Tea Snacks"
    ],
    "cuisineCategory": "South Indian",
    "recipeDescription": "healthy adai recipe | diabetic adai | Indian style dalia adai without rice | Indian snack for diabetes | With 27 amazing images. healthy adai is a nourishing South Indian snack which can be made on a weekday as well as on a weekend, and you will find the whole family flocking around the stove for more of this hot snack. Adai is a very popular snack in parts of South India, where it is served as breakfast or as a snack or for supper. Traditionally, this dosa-like snack is made with a batter of rice and lentils, flavoured with chillies, pepper and other ingredients. If you are looking for a healthy adai, here’s the recipe. In this Indian style dalia adai without rice, we have substituted rice with broken wheat, which not only matches up to the original in terms of flavour but also gives a unique texture that is absolutely delectable. To make healthy adai, combine the broken wheat, green moong dal, masoor dal, urad dal and fenugreek seeds in a deep bowl and soak in enough water for 2 hours. Drain well. Blend them in a mixer along with approx. ¾ cup of water to a coarse mixture. Transfer the mixture into a deep bowl, add the onions, asafoetida, ginger-green chilli paste, coriander, turmeric powder, curry leaves and salt and mix well. Heat a non-stick tava (griddle), sprinkle a little water on it and wipe it off gently using a muslin cloth. Pour a ladleful of the batter on it and spread it in a circular motion to make a 125 mm. (5”) diameter thin circle. Smear 1/8 tsp of oil over it and along the edges and cook on a medium flame till the adai turns golden brown in colour from both the sides. Serve immediately. Diabetics can have 2 of these Indian style dalia adai without rice for breakfast, to meet their nutrient requirements. Healthy individuals, heart patients, senior citizens and even kids would love to indulge in this healthy adai. Pregnant women and those women with PCOS who are looking forward to losing weight should include this diabetic adai in their diet. Serve it with a healthy green chutney to square up your meal of the day. This protein rich Indian style dalia adai without rice is a wise choice for all vegetarians who wish to enjoy a traditional meal to nourish their body cells, tissues and muscles. The broken wheat (dalia) is a good source of fibre and will also aid in giving a high satiety which will avoid binge eating. Tips for healthy adai. 1. Add water gradually while making the batter. The batter should be of pouring consistency and of coarse texture. 2. While making the adai, spread the batter in a circular motion only in one direction. Spreading clockwise and anti-clockwise both might form lumps in the adai. Enjoy healthy adai recipe | diabetic adai | Indian style dalia adai without rice | Indian snack for diabetes | with step by step photos and recipe below.",
    "recipeUrl": "adai--diabetic-adai-recipe-22270r"
  },
  {
    "recipeId": "rcp534",
    "recipeName": "Adai Recipe, Adai Dosa, Breakfast",
    "recipeCategory": "Dinner",
    "ingredients": [
      "par-boiled rice (ukda chawal)",
      "toovar (arhar) dal",
      "chana dal (split bengal gram)",
      "urad dal (split black lentils)",
      "chopped ginger (adrak)",
      "dry red chillies (pandi)",
      "black peppercorns (kalimirch)",
      "cumin seeds (jeera)",
      "chopped onions",
      "asafoetida (hing)",
      "chopped curry leaves (kadi patta)",
      "grated coconut",
      "salt",
      "coconut oil oil",
      "coconut chutney"
    ],
    "prepTime": "10 mins",
    "cookTime": "30 mins",
    "tag": [
      "South Indian",
      "Different Types of Dosa",
      "Dinner",
      "Breakfast Idlis / Dosas / Uttapam",
      "Indian Snacks for Entertaining",
      "Evening Tea Snacks",
      "Onam recipes, Kerala Onam Sadya"
    ],
    "cuisineCategory": "Kerala",
    "recipeDescription": "adai recipe | adai dosa | quick South-Indian style adai dosa | Chettinad kara adai | with amazing 29 images. adai is a crisp, golden dosa made using a batter of rice and mixed dals. adai dosa or quick South-Indian style adai dosa has the rich aroma of coconut oil and roasted dals, and a very rustic flavour as well. Dosa has put South India on every culinary hot spot of the world. We show you how to make adai dosa with detailed step by step recipe on how to make the perfect adai dosa batter. adai dosa can be prepared quickly, it doesn’t need fermentation and a long wait of overnight just requires soaking. adai dosa is much heavier and thicker than normal dosa. quick South-Indian style adai dosa is a protein packed dosa recipe which can be had as breakfast or evening snack. Chettinad kara adai is one of the common breakfast and a famous recipe of Tamil Nadu. South-Indian style adai dosa is more satiating than regular dosas and makes a great breakfast. adai dosa can be enhanced by adding onions or chopped drumstick leaves to the batter. You can also use adai dosa as a tiffin treat for your kids as it is a good way of adding protein to your kiddo’s diet. If you don’t wish to make all the adai dosa at once, add finely chopped onions and coconut only to the needed batter. You can refrigerate the rest of the batter which will stay good for 2-3 days if onions and coconut is not added to it. While adai tastes great with Coconut Chutney and Sambar, there is a more traditional way of serving it, topped with a dollop of butter and accompanied by Avial and grated jaggery. Learn to make adai recipe | adai dosa | quick South-Indian style adai dosa | Chettinad kara adai | with detailed step by step recipe photos and video below.",
    "recipeUrl": "adai-recipe-adai-dosa-breakfast-534r"
  },
  {
    "recipeId": "rcp33240",
    "recipeName": "Adai, Protein Rich Adai Recipe",
    "recipeCategory": "NA",
    "ingredients": [
      "rice (chawal)",
      "toovar (arhar) dal",
      "chana dal (split bengal gram)",
      "urad dal (split black lentils)",
      "whole dry kashmiri red chillies",
      "asafoetida (hing)",
      "grated coconut",
      "grated carrot",
      "chopped cabbage",
      "chopped onions",
      "chopped coriander (dhania)",
      "chopped curry leaves (kadi patta)",
      "salt",
      "oil"
    ],
    "prepTime": "15 mins",
    "cookTime": "30 mins",
    "tag": [
      "Healthy Indian Recipes",
      "South Indian Evening Snacks",
      "Breakfast Idlis / Dosas / Uttapam",
      "Evening Tea Snacks",
      "Tava",
      "Snack Recipes for Kids",
      "Protein rich food for kids"
    ],
    "cuisineCategory": "South Indian",
    "recipeDescription": "Adai, an all-time favourite South Indian snack , comprises a mix of different dals soaked and ground along with rice and spices to make a batter, which is cooked into thick pancakes. Add Adai to your meal to elevate the protein quotient to great heights! Dals are good, inexpensive sources of protein. Cereals and pulses lack an amino acid each, which makes it essential to combine them in a balanced way to improve the protein quality. This logic plays out beautifully in the recipe of Adai, a traditional south Indian recipe to be treasured.",
    "recipeUrl": "adai-protein-rich-adai-recipe-33240r"
  },
  {
    "recipeId": "rcp2850",
    "recipeName": "Adrak Aur Ganne ka Slush, Sugarcane and Ginger Slush",
    "recipeCategory": "NA",
    "ingredients": [
      "ginger (adrak) juice",
      "sugarcane juice",
      "powdered sugar",
      "lemon",
      "salt"
    ],
    "prepTime": "10 mins",
    "cookTime": "0 mins",
    "tag": [
      "Indian Drinks / Sharbats",
      "Indian Sorbets / Indian Frozen Desserts",
      "Sweet Recipes for Kids",
      "Kids After School"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "The streets of Mumbai are dotted with vendors selling \"ganne ka ras\" (sugarcane juice) extracted by pressing the sweet \" ganna\" or sugarcane. We are so familiar with the sight of fresh sugarcane juice that it is not a novelty. But when the same is frozen with a dash of ginger juice and lemon, it transforms itself into an exciting and delightful slush. If you like slush check these out- Watermelon Slush , Mock Peach Slush , Aam Lassi Slush .",
    "recipeUrl": "adrak-aur-ganne-ka-slush-sugarcane-and-ginger-slush-2850r"
  },
  {
    "recipeId": "rcp4752",
    "recipeName": "Affogato",
    "recipeCategory": "NA",
    "ingredients": [
      "vanilla ice-cream",
      "instant coffee powder",
      "brandy",
      "sugar",
      "cinnamon (dalchini) powder"
    ],
    "prepTime": "2 mins",
    "cookTime": "5 mins",
    "tag": [
      "Indian Mocktails",
      "Indian Coffee Recipes",
      "High Tea Party",
      "Quick Indian Sweets"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "A tantalizing treat for adults, Affogato features a rich coffee-brandy cocktail served atop creamy Vanilla ice-cream. Laced with cinnamon powder, this heart-warming beverage sets the perfect mood for a long chat with a loved one.",
    "recipeUrl": "affogato-4752r"
  },
  {
    "recipeId": "rcp30939",
    "recipeName": "Afghani Paneer",
    "recipeCategory": "Dinner",
    "ingredients": [
      "paneer (cottage cheese) cubes",
      "melon seeds (charmagaz)",
      "cashew nuts (kaju)",
      "poppy seeds (khus-khus)",
      "fresh cream",
      "milk",
      "butter",
      "white pepper powder",
      "garam masala",
      "green chilli paste",
      "salt",
      "oil"
    ],
    "prepTime": "10 mins",
    "cookTime": "20 mins",
    "tag": [
      "Mughlai Sabzis, Veg Mughlai sabzi, Curries",
      "Dinner",
      "Karwa Chauth",
      "Cocktail Party",
      "Tava",
      "North Indian Dinner"
    ],
    "cuisineCategory": "North Indian",
    "recipeDescription": "Afghani paneer recipe | restaurant style Afghani paneer | paneer Afghani | how to make Afghani paneer tikka at home | Afghani paneer tikka is from the kitchens of Mughals. Learn how to make restaurant style Afghani paneer. The Mughal maharajas had an umpteen number of chefs who spent laborious hours toiling in the kitchens to prepare the perfect meal. They ground most ingredients to powders to ensure the perfect eating experience. The spice powder of this paneer Afghani, is a classic example of this. To make Afghani paneer, combine the melon seeds, cashews and poppy seeds in a mixer jar and blend till you get a smooth powder. Then make a marinade by combining fresh cream, milk, butter, white pepper powder, garam masala, chilli paste and salt. Combine the paneer cubes with this powder and marinade, toss gently and keep aside to marinate for 2 hours. Thread 6 pieces of the marinated paneer in each satay stick or a skewer. Heat a non-stick tava (griddle), grease it with little oil, place 4 marinated paneer satays on it and cook using a little oil on a medium flame for approx. 10 minutes or till they turn brown in colour from all the sides. In this restaurant style Afghani paneer, the paneer should be extremely fresh, else it will break. Make big cubes and not small so that the pieces do not break while inserting them on a satay stick. Marinating the paneer for at least 1 to 2 hours ensures that all the flavours of the marinade are absorbed. Remember to serve this Afghani paneer tikka immediately off the tava. Enjoy Afghani paneer recipe | restaurant style Afghani paneer | paneer Afghani | how to make Afghani paneer tikka at home.",
    "recipeUrl": "afghani-paneer-30939r"
  },
  {
    "recipeId": "rcp42874",
    "recipeName": "Air Fried Bhindi, Healthy Air Fryer Crispy Okra",
    "recipeCategory": "NA",
    "ingredients": [
      "ladies finger (bhindi)",
      "olive oil",
      "chaat masala",
      "chilli powder",
      "salt"
    ],
    "prepTime": "10 mins",
    "cookTime": "10 mins",
    "tag": [
      "Indian Veg Recipes",
      "Indian Party",
      "Indian Party Starters",
      "Healthy Quick Snack Ideas",
      "Marathoners, Endurance Athletes, Triathlete Snacks"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "air fried bhindi recipe | healthy air fryer crispy okra (ladies finger) | quick Indian air fried bhindi | with 25 amazing images. air fried bhindi recipe | healthy air fryer crispy okra (ladies finger) | quick Indian air fried bhindi is a crunchy fare to be enjoyed with friends and family at snack time. Learn how to make healthy air fryer crispy okra. To make air fried bhindi, wash the ladies finger, trim the tips from both the sides and discard them. Slice each bhindi into 4 pieces length wise, add olive oil and mix well. Place the bhindi in an air fryer and cook at 200°c for 10 minutes, while stirring once after 5 minutes. Add the masala powder and mix well. Serve healthy air fryer crispy okra (ladies finger) immediately. Crispy bhindi is a snack which most of us have relished at restaurants and parties. But quite often we resist because of its deep fried cooking method which involves oodles of oil. So here present to you quick Indian air fried bhindi, a non-fried version of crispy bhindi. So what\u0027s interesting for weight watchers is that 1 serving of this healthy air fryer crispy okra (ladies finger) lends only 43 calories. The mix of chaat masala, chilli powder and salt perk it up flawlessly thus making it a blend of flavour and nourishment. Heart patients and diabetics too can enjoy this air fried bhindi. With not too many carbs to offer, this snack will help manage blood sugar levels. Tips for air fried bhindi. 1. Serve air fried bhindi immediately as it will remain crisp for a short while. 2. The bhindi will shrink in size after we air fryer. 3. Add 1/4 tsp amchur powder to the masala if you want more lemon flavour. Enjoy air fried bhindi recipe | healthy air fryer crispy okra (ladies finger) | quick Indian air fried bhindi | with step by step photos.",
    "recipeUrl": "air-fried-bhindi-healthy-air-fryer-crispy-okra-42874r"
  },
  {
    "recipeId": "rcp42873",
    "recipeName": "Air Fried Shakarkand, Indian Style Sweet Potato Fries",
    "recipeCategory": "NA",
    "ingredients": [
      "sweet potato (shakarkand)",
      "chaat masala",
      "chilli powder",
      "freshly ground black pepper (kalimirch)",
      "salt",
      "olive oil"
    ],
    "prepTime": "5 mins",
    "cookTime": "14 mins",
    "tag": [
      "Indian Veg Recipes",
      "American Breakfast",
      "Quick Evening Snacks",
      "Indian Snacks for Entertaining",
      "Evening Tea Snacks",
      "Indian Party",
      "High Tea Party"
    ],
    "cuisineCategory": "Indian",
    "recipeDescription": "air fried shakarkand recipe | air fryer sweet potatoes | Indian style air fried sweet potatoes fries | quick air fryer sweet potatoes | with 24 amazing images. air fried shakarkand recipe | air fryer sweet potatoes | Indian style air fried sweet potatoes fries | quick air fryer sweet potatoes | is a healthy snack which can be served within 15 minutes. Learn how to make Indian style air fried sweet potatoes fries. To make air fryer sweet potatoes, in a small bowl put the chaat masala. Then add chilli powder, black pepper and salt. Mix well. Peel the shakarkand. Then cut into strips and cubes. We have cut into 2 different shapes to show you. You can use any shape. Brush the shakarkand with 1 tsp olive oil. Then place the shakarkand in an air fryer and cook at 200 c for 14 minutes. At 5 minutes and 10 minutes, open the air fryer and toss the shakarkand each time and then continue cooking. Place the air fried shakarkand in a bowl. Add 1/2 tsp olive oil and toss. Add the masala powder and mix well. Serve air fried shakarkand immediately as it will remain crisp for a short while. Indian style air fried sweet potatoes fries is a non-fried snack made in an air-fryer. With minimal oil used for brushing the sweet potatoes, heart patients can benefit from the potassium in it which helps is balancing the excess sodium levels in the body. While weight-watchers can enjoy small portions of this air fryer sweet potatoes, they should not neglect its carb count. The fibre in it will help them keep satiated for long hours. The olive oil used for brushing is rich in MUFA (mono unsaturated fatty acids) which will help to reduce inflammation in the body. fibre is one of the key nutrients required for clear vision and sweet potatoes have them in plentiful. Quick air fryer sweet potatoes is a simple and easy way of making up for daily requirement of this vitamin too. Tips for air fried shakarkand. Serve air fried shakarkand immediately as it will remain crisp for a short while. Enjoy air fried shakarkand recipe | air fryer sweet potatoes | Indian style air fried sweet potatoes fries | quick air fryer sweet potatoes | with step by step photos.",
    "recipeUrl": "air-fried-shakarkand-indian-style-sweet-potato-fries-42873r"
  }
]